app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asda"], ["created_at", 2017-02-02 14:31:04 UTC], ["updated_at", 2017-02-02 14:31:04 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "Pikachu-Deadpool.jpg"], ["avatar_file_size", 29177], ["avatar_updated_at", 2017-02-02 15:57:13 UTC], ["updated_at", 2017-02-02 15:57:13 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)